Repository: CofficLab/Lumi
Catalog: LumiApp/Plugins/EditorXcodePlugin/EditorXcodePlugin.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: '%@' belongs to multiple targets (%@), cannot uniquely determine semantic context
zh_hans: '%@' 属于多个目标（%@），无法唯一确定语义上下文
zh_hk: '%@' 屬於多個目標（%@），無法唯一確定語義上下文

source: '%@' belongs to multiple targets (%@), current scheme '%@' cannot uniquely determine semantic context
zh_hans: '%@' 属于多个目标（%@），当前 scheme '%@' 无法唯一确定语义上下文
zh_hk: '%@' 屬於多個目標（%@），當前 scheme '%@' 無法唯一確定語義上下文

source: '%@' belongs to target (%@), but current active scheme does not include these targets
zh_hans: '%@' 属于目标（%@），但当前活动 scheme 不包含这些目标
zh_hk: '%@' 屬於目標（%@），但當前活動 scheme 不包含這些目標

source: '%@' belongs to target (%@), but current scheme '%@' does not include these targets
zh_hans: '%@' 属于目标（%@），但当前 scheme '%@' 不包含这些目标
zh_hk: '%@' 屬於目標（%@），但當前 scheme '%@' 不包含這些目標

source: '%@' does not belong to any compilation target, please check if the file is in the project
zh_hans: '%@' 不属于任何编译目标，请检查文件是否在项目中
zh_hk: '%@' 不屬於任何編譯目標，請檢查文件是否在項目中

source: '%@' does not belong to any compilation target.
zh_hans: '%@' 不属于任何编译目标。
zh_hk: '%@' 不屬於任何編譯目標。

source: "%@" is not bound to any compilation target. Cross-file semantic navigation may be unavailable.
zh_hans: "%@" 未绑定到任何编译目标。跨文件语义导航可能不可用。
zh_hk: "%@" 未綁定到任何編譯目標。跨文件語義導航可能不可用。

source: Add the file to a target
zh_hans: 将文件添加到目标
zh_hk: 將文件添加到目標

source: App Groups - Shared app group
zh_hans: App Groups - 共享应用组
zh_hk: App Groups - 共享應用群組

source: App Transport Security - Network security
zh_hans: App 传输安全 - 网络安全
zh_hk: App 傳輸安全 - 網絡安全

source: Associated Domains
zh_hans: 关联域名
zh_hk: 關聯域名

source: Audio Input
zh_hans: 音频输入
zh_hk: 音頻輸入

source: Available
zh_hans: 可用
zh_hk: 可用

source: Available (scheme: %@)
zh_hans: 可用（scheme: %@）
zh_hk: 可用（scheme: %@）

source: Bluetooth Usage - Bluetooth access description
zh_hans: 蓝牙使用 - 蓝牙访问描述
zh_hk: 藍牙使用 - 藍牙訪問描述

source: Build Context
zh_hans: 构建上下文
zh_hk: 構建上下文

source: Build Context Needs Sync
zh_hans: 构建上下文需要同步
zh_hk: 構建上下文需要同步

source: Build context needs to be resynchronized
zh_hans: 构建上下文需要重新同步
zh_hk: 構建上下文需要重新同步

source: Build Context Unavailable
zh_hans: 构建上下文不可用
zh_hk: 構建上下文不可用

source: Build context unavailable: %@
zh_hans: 构建上下文不可用：%@
zh_hk: 構建上下文不可用：%@

source: Bundle ID - Unique app identifier
zh_hans: Bundle ID - 唯一应用标识符
zh_hk: Bundle ID - 唯一應用標識符

source: Bundle Name - Application name
zh_hans: Bundle 名称 - 应用名称
zh_hk: Bundle 名稱 - 應用名稱

source: Bundle Signature
zh_hans: Bundle 签名
zh_hk: Bundle 簽名

source: Bundle Version - Build version number
zh_hans: Bundle 版本 - 构建版本号
zh_hk: Bundle 版本 - 構建版本號

source: Camera
zh_hans: 相机
zh_hk: 相機

source: Camera Usage - Camera access description
zh_hans: 相机使用 - 相机访问描述
zh_hk: 相機使用 - 相機訪問描述

source: Communication Notifications
zh_hans: 通讯通知
zh_hk: 通訊通知

source: Config
zh_hans: 配置
zh_hk: 配置

source: Configuration
zh_hans: 配置
zh_hk: 配置

source: Current File
zh_hans: 当前文件
zh_hk: 當前文件

source: Current file belongs to %@, but current scheme cannot uniquely determine semantic context.
zh_hans: 当前文件属于 %@，但当前 scheme 无法唯一确定语义上下文。
zh_hk: 當前文件屬於 %@，但當前 scheme 無法唯一確定語義上下文。

source: Current file is not bound to a valid Xcode project context
zh_hans: 当前文件未绑定到有效的 Xcode 项目上下文
zh_hk: 當前文件未綁定到有效的 Xcode 項目上下文

source: Current file matches multiple targets, currently resolving with '%@'.
zh_hans: 当前文件匹配多个目标，当前使用 '%@' 解析。
zh_hk: 當前文件匹配多個目標，當前使用 '%@' 解析。

source: Current scheme '%@' does not include %@.
zh_hans: 当前 scheme '%@' 不包含 %@。
zh_hk: 當前 scheme '%@' 不包含 %@。

source: Destination
zh_hans: 目标平台
zh_hk: 目標平台

source: Destination Undetermined
zh_hans: 目标平台未确定
zh_hk: 目標平台未確定

source: Display Name - Shown on Home screen
zh_hans: 显示名称 - 在主屏幕上显示
zh_hk: 顯示名稱 - 在主螢幕上顯示

source: Ensure .xcodeproj/.xcworkspace is in the project root directory
zh_hans: 确保 .xcodeproj/.xcworkspace 在项目根目录中
zh_hk: 確保 .xcodeproj/.xcworkspace 在項目根目錄中

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Failed to generate buildServer.json
zh_hans: 生成 buildServer.json 失败
zh_hk: 生成 buildServer.json 失敗

source: File Not in Target
zh_hans: 文件不在目标中
zh_hk: 文件不在目標中

source: File Not Registered in Project
zh_hans: 文件未在项目中注册
zh_hk: 文件未在項目中註冊

source: Got It
zh_hans: 知道了
zh_hk: 知道了

source: iCloud Containers
zh_hans: iCloud 容器
zh_hk: iCloud 容器

source: Indexing %d%%
zh_hans: 索引中 %d%%
zh_hk: 索引中 %d%%

source: Indexing...
zh_hans: 索引中...
zh_hk: 索引中...

source: Keychain Access Groups
zh_hans: 钥匙串访问组
zh_hk: 鑰匙串訪問組

source: Launch Storyboard - Launch screen storyboard
zh_hans: 启动 Storyboard - 启动屏幕 Storyboard
zh_hk: 啟動 Storyboard - 啟動螢幕 Storyboard

source: Location Usage - Location access description
zh_hans: 位置使用 - 位置访问描述
zh_hk: 位置使用 - 位置訪問描述

source: LSP Not Initialized
zh_hans: LSP 未初始化
zh_hk: LSP 未初始化

source: LSP request timed out, please try again later
zh_hans: LSP 请求超时，请稍后再试
zh_hk: LSP 請求超時，請稍後再試

source: LSP server connection lost, attempting to reconnect...
zh_hans: LSP 服务器连接丢失，正在尝试重新连接...
zh_hk: LSP 伺服器連接丟失，正在嘗試重新連接...

source: LSP server not started, unable to process request
zh_hans: LSP 服务器未启动，无法处理请求
zh_hk: LSP 伺服器未啟動，無法處理請求

source: Main Storyboard - Main storyboard file
zh_hans: 主 Storyboard - 主 Storyboard 文件
zh_hk: 主 Storyboard - 主 Storyboard 文件

source: Matched Targets
zh_hans: 匹配的目标
zh_hk: 匹配的目標

source: Minimum System Version - Minimum OS version
zh_hans: 最低系统版本 - 最低操作系统版本
zh_hk: 最低系統版本 - 最低操作系統版本

source: Missing CFBundleIdentifier
zh_hans: 缺少 CFBundleIdentifier
zh_hk: 缺少 CFBundleIdentifier

source: Missing CFBundleShortVersionString
zh_hans: 缺少 CFBundleShortVersionString
zh_hk: 缺少 CFBundleShortVersionString

source: Missing CFBundleVersion
zh_hans: 缺少 CFBundleVersion
zh_hk: 缺少 CFBundleVersion

source: Multi-Target Ambiguity
zh_hans: 多目标歧义
zh_hk: 多目標歧義

source: Multi-Target File
zh_hans: 多目标文件
zh_hk: 多目標文件

source: Needs resync
zh_hans: 需要重新同步
zh_hk: 需要重新同步

source: Needs Sync
zh_hans: 需要同步
zh_hk: 需要同步

source: No .xcodeproj / .xcworkspace found
zh_hans: 未找到 .xcodeproj / .xcworkspace
zh_hk: 未找到 .xcodeproj / .xcworkspace

source: No editor context snapshot available.
zh_hans: 没有可用的编辑器上下文快照。
zh_hk: 沒有可用的編輯器上下文快照。

source: No File Open
zh_hans: 没有打开的文件
zh_hk: 沒有打開的文件

source: No matching symbol found
zh_hans: 未找到匹配的符号
zh_hk: 未找到匹配的符號

source: None
zh_hans: 无
zh_hk: 無

source: Not Detected
zh_hans: 未检测到
zh_hk: 未檢測到

source: Not Initialized
zh_hans: 未初始化
zh_hk: 未初始化

source: Not Selected
zh_hans: 未选择
zh_hk: 未選擇

source: Not Started
zh_hans: 未启动
zh_hk: 未啟動

source: Open in Xcode
zh_hans: 在 Xcode 中打开
zh_hk: 在 Xcode 中打開

source: Package Type - Bundle package type
zh_hans: 包类型 - Bundle 包类型
zh_hk: 包類型 - Bundle 包類型

source: Photo Library Usage - Photo library access description
zh_hans: 照片库使用 - 照片库访问描述
zh_hk: 照片庫使用 - 照片庫訪問描述

source: Preferred Target
zh_hans: 首选目标
zh_hk: 首選目標

source: Preload completed: %lld succeeded
zh_hans: 预加载完成：%lld 个成功
zh_hk: 預加載完成：%lld 個成功

source: Preload completed: %lld succeeded, %lld failed
zh_hans: 预加载完成：%lld 个成功，%lld 个失败
zh_hk: 預加載完成：%lld 個成功，%lld 個失敗

source: Preloading %lld project(s)...
zh_hans: 正在预加载 %lld 个项目...
zh_hk: 正在預加載 %lld 個項目...

source: Principal Class
zh_hans: 主类
zh_hk: 主類

source: Project is being indexed, semantic navigation may be incomplete
zh_hans: 项目正在索引中，语义导航可能不完整
zh_hk: 項目正在索引中，語義導航可能不完整

source: Project Keys
zh_hans: 项目配置项
zh_hk: 項目配置項

source: Project path does not exist: %@
zh_hans: 项目路径不存在：%@
zh_hk: 項目路徑不存在：%@

source: Provides Xcode project identity, build context, and sourcekit-lsp integration for Swift projects.
zh_hans: 为 Swift 项目提供 Xcode 项目标识、构建上下文和 sourcekit-lsp 集成。
zh_hk: 為 Swift 項目提供 Xcode 項目標識、構建上下文和 sourcekit-lsp 集成。

source: Re-resolve Build Context
zh_hans: 重新解析构建上下文
zh_hk: 重新解析構建上下文

source: Re-resolving...
zh_hans: 重新解析中...
zh_hk: 重新解析中...

source: Ready
zh_hans: 就绪
zh_hk: 就緒

source: Required Capabilities - Required device capabilities
zh_hans: 必需功能 - 必需的设备功能
zh_hk: 必需功能 - 必需的設備功能

source: Resolving build context...
zh_hans: 正在解析构建上下文...
zh_hk: 正在解析構建上下文...

source: Resolving...
zh_hans: 解析中...
zh_hk: 解析中...

source: Run brew install xcode-build-server and reopen the project
zh_hans: 运行 brew install xcode-build-server 并重新打开项目
zh_hk: 運行 brew install xcode-build-server 並重新打開項目

source: Scene Manifest - Scene configuration
zh_hans: 场景清单 - 场景配置
zh_hk: 場景清單 - 場景配置

source: Scheme Does Not Cover File Target
zh_hans: Scheme 未覆盖文件所在目标
zh_hk: Scheme 未覆蓋文件所在目標

source: Scheme Targets
zh_hans: Scheme 目标
zh_hk: Scheme 目標

source: Semantic Availability
zh_hans: 语义可用性
zh_hk: 語義可用性

source: Short Version - Marketing version number
zh_hans: 短版本号 - 营销版本号
zh_hk: 短版本號 - 營銷版本號

source: Sign in with Apple
zh_hans: 通过 Apple 登录
zh_hk: 通過 Apple 登入

source: Suggested value for %@
zh_hans: %@ 的建议值
zh_hk: %@ 的建議值

source: Suggested values:
zh_hans: 建议值：
zh_hk: 建議值：

source: Supported Orientations - Supported interface orientations
zh_hans: 支持的方向 - 支持的界面方向
zh_hk: 支持的方向 - 支持的界面方向

source: Swift semantic indexing in progress
zh_hans: Swift 语义索引进行中
zh_hk: Swift 語義索引進行中

source: Switch to a more specific scheme, or keep only one target membership and retry
zh_hans: 切换到更具体的 scheme，或仅保留一个目标成员身份后重试
zh_hk: 切換到更具體的 scheme，或僅保留一個目標成員身份後重試

source: Switch to a scheme that includes the file's target and retry
zh_hans: 切换到包含该文件目标的 scheme 后重试
zh_hk: 切換到包含該文件目標的 scheme 後重試

source: Target platform for current editor semantic context
zh_hans: 当前编辑器语义上下文的目标平台
zh_hk: 當前編輯器語義上下文的目標平台

source: Team Identifier
zh_hans: 团队标识符
zh_hk: 團隊標識符

source: The current build context has expired, workspace semantic results may be inaccurate.
zh_hans: 当前构建上下文已过期，工作区语义结果可能不准确。
zh_hk: 當前構建上下文已過期，工作區語義結果可能不準確。

source: The current target platform has not yet been resolved.
zh_hans: 当前目标平台尚未解析。
zh_hk: 當前目標平台尚未解析。

source: The current Xcode project context has not yet completed initialization.
zh_hans: 当前 Xcode 项目上下文尚未完成初始化。
zh_hk: 當前 Xcode 項目上下文尚未完成初始化。

source: Try again
zh_hans: 重试
zh_hk: 重試

source: Try reopening the file or restarting Lumi
zh_hans: 请尝试重新打开文件或重启 Lumi
zh_hk: 請嘗試重新打開文件或重啟 Lumi

source: Unable to parse as valid plist
zh_hans: 无法解析为有效的 plist
zh_hk: 無法解析為有效的 plist

source: Unable to parse project
zh_hans: 无法解析项目
zh_hk: 無法解析項目

source: Unable to resolve symbol%@
zh_hans: 无法解析符号%@
zh_hk: 無法解析符號%@

source: Unavailable
zh_hans: 不可用
zh_hk: 不可用

source: Unavailable: %@
zh_hans: 不可用：%@
zh_hk: 不可用：%@

source: Undetermined
zh_hans: 未确定
zh_hk: 未確定

source: Unknown
zh_hans: 未知
zh_hk: 未知

source: Wait for auto-reconnect, or manually switch files to trigger rebuild
zh_hans: 等待自动重连，或手动切换文件以触发重新构建
zh_hk: 等待自動重連，或手動切換文件以觸發重新構建

source: Wait for indexing to complete and retry, or check sourcekit-lsp logs
zh_hans: 等待索引完成后重试，或检查 sourcekit-lsp 日志
zh_hk: 等待索引完成後重試，或檢查 sourcekit-lsp 日誌

source: Wait for indexing to complete and try again
zh_hans: 等待索引完成后重试
zh_hk: 等待索引完成後重試

source: WiFi Info
zh_hans: WiFi 信息
zh_hk: WiFi 資訊

source: Workspace
zh_hans: 工作区
zh_hk: 工作區

source: Xcode Context
zh_hans: Xcode 上下文
zh_hk: Xcode 上下文

source: Xcode Project Editor
zh_hans: Xcode 项目编辑器
zh_hk: Xcode 項目編輯器

source: xcode-build-server not installed, please run: brew install xcode-build-server
zh_hans: 未安装 xcode-build-server，请运行：brew install xcode-build-server
zh_hk: 未安裝 xcode-build-server，請運行：brew install xcode-build-server
